Your configuration does work very well with me. Strange! I re-adjusted your configuration without modifying the parameters. Can you please try the following configuration on your device?

**1 Init status**
```
myFortiGate # get system status
Version: FortiGate-VM64 v6.2.4,build1112,200511 (GA)

myFortiGate # config system ha
myFortiGate (ha) # show
config system ha
    set override disable
end

myFortiGate # config system probe-response
myFortiGate (probe-response) # show
config system probe-response
end

```
**2 Delete old autoscripts**

**3 Terraform config**
```
# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token = "twHgtmQn30gps41388dds8m3drc3rw"
  insecure = "true"
}

variable cluster_sync_peerip {
  type        = string
  default     = "10.0.3.5"
  description = "description"
}

variable on_premises_management_route_gateway {
  type        = string
  default     = "10.0.4.1"
  description = "description"
}

resource "fortios_system_proberesponse" "trname" {
  http_probe_value = "OK"
  mode             = "http-probe"
}

resource "fortios_system_autoscript" "HA1" {
  interval    = 1
  name        = "HA"
  output_size = 10
  repeat      = 1
  script      = <<EOF
config system ha
  set session-pickup enable
  set session-pickup-connectionless enable
  set session-pickup-expectation enable
  set session-pickup-nat enable
  set override disable
  set group-name AzureHA
  set mode a-p
  set hbdev port3 100
end
EOF
  start       = "auto"
}

resource "fortios_system_autoscript" "HA2" {
  interval    = 3
  name        = format("%s%s", fortios_system_autoscript.HA1.name, "ex")
  output_size = 10
  repeat      = 1
  script      = <<EOF
config system ha
  set priority 100
  set unicast-hb enable
  set unicast-hb-peerip ${var.cluster_sync_peerip}
  set ha-mgmt-status enable
  config ha-mgmt-interfaces
    edit 1
      set interface port1
      set gateway ${var.on_premises_management_route_gateway}
    end
  end
end
EOF
  start       = "auto"
}
```

**4 Terraform Apply**
```
# terraform apply
2020/09/29 08:07:08 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_autoscript.HA1 will be created
  + resource "fortios_system_autoscript" "HA1" {
      + id          = (known after apply)
      + interval    = 1
      + name        = "HA"
      + output_size = 10
      + repeat      = 1
      + script      = <<~EOT
            config system ha
              set session-pickup enable
              set session-pickup-connectionless enable
              set session-pickup-expectation enable
              set session-pickup-nat enable
              set override disable
              set group-name AzureHA
              set mode a-p
              set hbdev port3 100
            end
        EOT
      + start       = "auto"
    }

  # fortios_system_autoscript.HA2 will be created
  + resource "fortios_system_autoscript" "HA2" {
      + id          = (known after apply)
      + interval    = 3
      + name        = "HAex"
      + output_size = 10
      + repeat      = 1
      + script      = <<~EOT
            config system ha
              set priority 100
              set unicast-hb enable
              set unicast-hb-peerip 10.0.3.5
              set ha-mgmt-status enable
              config ha-mgmt-interfaces
                edit 1
                  set interface port1
                  set gateway 10.0.4.1
                end
              end
            end
        EOT
      + start       = "auto"
    }

  # fortios_system_proberesponse.trname will be created
  + resource "fortios_system_proberesponse" "trname" {
      + http_probe_value = "OK"
      + id               = (known after apply)
      + mode             = "http-probe"
      + port             = (known after apply)
      + security_mode    = (known after apply)
      + timeout          = (known after apply)
      + ttl_mode         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_proberesponse.trname: Creating...
fortios_system_autoscript.HA1: Creating...
fortios_system_proberesponse.trname: Creation complete after 0s [id=SystemProbeResponse]
fortios_system_autoscript.HA1: Creation complete after 0s [id=HA]
fortios_system_autoscript.HA2: Creating...
fortios_system_autoscript.HA2: Creation complete after 0s [id=HAex]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

**5 Validation**
```
myFortiGate # config system ha

myFortiGate (ha) # show
path=system, objname=ha, tablename=(null), size=5912
config system ha
    set group-name "AzureHA"
    set mode a-p
    set hbdev "port3" 100
    set session-pickup enable
    set session-pickup-connectionless enable
    set session-pickup-expectation enable
    set ha-mgmt-status enable
    config ha-mgmt-interfaces
        edit 1
            set gateway 10.0.4.1
        next
    end
    set override disable
    set priority 100
    set unicast-hb enable
    set unicast-hb-peerip 10.0.3.5
end

myFortiGate # config system probe-response

myFortiGate (probe-response) # show
path=system, objname=probe-response, tablename=(null), size=1166
config system probe-response
    set mode http-probe
end

```
Does this make sense? Thanks! 
